In [ ]:
# ex 1
# A company’s financial reports stored in an Excel file. (Structured)
# Photographs uploaded to a social media platform. (Unstructured)
# A collection of news articles on a website. (Unstructured)
# Inventory data in a relational database. (Structured)
# Recorded interviews from a market research study. (Unstructured)

In [ ]:
# ex 2
# Blog posts about travel: pick out basic info like city, date, and activities and put them in a table.
# Customer service calls: listen to the calls, write down customer name, issue, and result in a table.
# Handwritten notes: read the notes and make a table with ideas, categories, or priorities.
# Cooking video: watch the video and list steps, ingredients, and time in a table.
# Turning messy information (text, audio, video, handwriting) into rows and columns so it’s easy to read, sort, and analyze.

In [1]:
import pandas as pd

data_frame = pd.read_csv('../../day_1/data/Titanic/train.csv')

data_frame.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
iris_df = pd.read_csv('../../day_1/data/Iris Dataset/Iris.csv')

iris_df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [7]:
iris_df.to_json('iris.json', orient='records')
iris_df.to_excel('iris.xlsx', index=False)

In [8]:
json_df = pd.read_json('./posts.json')
json_df.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...